import { type Ai } from '../types/ai';

const ai: Ai = {
  heroSection: {
    title: [
      {
        type: 'span',
        text: 'Virufy ',
      },
      {
        type: 'text',
        text: 'العلم وراء ',
      },
    ],
    text: 'الذكاء الاصطناعي قادر على اكتشاف الفروقات الدقيقة في أنماط الصوت للكشف عن وجود الأمراض.',
    url: '/publications',
    linkText: 'أبحاثنا',
  },
  aiSection: {
    title: 'كيف يعمل الذكاء الاصطناعي؟',
    aiCards: [
      {
        title: '01',
        text: 'تستخدم تطبيقنا الرائد تقنية الذكاء الاصطناعي المتطورة لتحليل أنماط التنفس باستخدام خوارزميات التعلم العميق وتقنيات معالجة الإشارات الصوتية.',
        style: 'tracking-widest text-[2.5rem] sm:text-6xl',
      },
      {
        title: '02',
        text: 'تقوم الخوارزمية بفحص العناصر المختلفة للسعال، مثل المدة والتكرار ودرجة الصوت. ومن خلال الاستفادة من قاعدة بيانات شاملة، يقارن الذكاء الاصطناعي بدقة أنماط السعال المسجلة مع المؤشرات المعروفة لأمراض الجهاز التنفسي، مما يسمح بالكشف المبكر عن المشكلات الصحية المحتملة.',
        style: 'text-[2.5rem] sm:text-6xl',
      },
    ],
  },
};

export default ai;
