import { type AmilsStory } from '../types/amilsStory';

const amilsStory: AmilsStory = {
  sectionAmil: {
    titleAmil: 'قصة أميل',
    textAmil: [
      'وُلد أميل ونشأ في وادي السيليكون ضمن عائلة مهاجرة، حيث تلقى التعليم في المنزل وبدأ الدراسة في الكلية المجتمعية وهو في الرابعة عشرة من عمره. تأثر أميل بتفاني والده في الخدمة الاجتماعية، وقضى طفولته في أنشطة تطوعية مثل إطعام المشردين في مطابخ الطعام. بعد ذلك بفترة وجيزة، توفي والد أميل في حادث سيارة مأساوي بسبب سائق مخمور. وعلى الرغم من الصراع العاطفي مع فقدان بطله، حصل أميل على أول وظيفة له كمستشار برمجيات يعمل على تطوير تقنية التعرف على الصور للتصحيح التلقائي للاختبارات في مدارس K-12.',
      'بعد حصوله على درجة البكالوريوس في علوم الكمبيوتر من جامعة كاليفورنيا في بيركلي، انضم أميل إلى شركة هيوليت باكارد (HP) في وادي السيليكون للعمل بدوام كامل كمهندس برمجيات يطور برامج توحيد سجلات الأمان لنظام إدارة معلومات وأمن الأمان (SIEM) الخاص بـ ArcSight.',
      'بحثًا عن منزل جديد، انتقل أميل إلى المقر الرئيسي لشركة HP في طوكيو لتولي دور مستشار للأمن السيبراني، حيث سافر عبر هونغ كونغ وطوكيو وأستراليا لنشر حلول SIEM في مواقع العملاء في صناعة البنوك.',
      'بعد ذلك، عاد أميل إلى وادي السيليكون للانضمام إلى شركة Pivotal Software كمهندس برمجيات يعمل بشكل رئيسي على قاعدة بيانات Greenplum OLAP المفتوحة المصدر المستندة إلى Postgres. في بيئة البرمجة المتطرفة (XP) الخاصة بـ Pivotal، مارس أميل عدة ممارسات لتطوير البرمجيات، بما في ذلك البرمجة الزوجية اليومية، وتطوير البرمجيات المدفوع بالاختبارات (TDD)، والاجتماعات الرجعية الأسبوعية، مع التناوب عبر عدة فرق، بما في ذلك DevOps وخلفية قاعدة البيانات وأدوات إدارة عبء العمل.',
      'في عام 2018، أخذ أميل إجازة من العمل للانتقال إلى الريف الياباني. عاش في بلدة إيهيجي، مسقط رأس زن سوتو، حيث كان يتأمل يوميًا ويتعلم فلسفة زن، بينما يساهم في تعليم البرمجة المرنة للشباب والأطفال. وسرعان ما تم تعيين أميل سفير التطور للمدينة وتم إرساله إلى مؤتمر One Young World في هولندا لتمثيل اليابان بين قادة الشباب المؤثرين اجتماعيًا ورؤساء الدول وحائزين على جائزة نوبل من 195 دولة.',
      'في أواخر عام 2019، ترك أميل وظيفته لمتابعة الدراسات العليا في الذكاء الاصطناعي بجامعة ستانفورد، حيث أخذ أولى دوراته مع مؤسس Coursera الدكتور أندرو نغ ومبتكرة ImageNet الدكتورة فاي فاي لي. عندما ضربت الجائحة، كرس أميل نفسه لجهود الإغاثة من الجائحة وسرعان ما أسس Virufy.',
      'Virufy هي منظمة غير ربحية تطور تطبيقًا للهواتف الذكية لفحص COVID-19 على الفور من خلال تحليل مدعوم بالذكاء الاصطناعي لتسجيلات الصوت والسعال. اعتبارًا من يوليو 2024، تعمل المنظمة في ثلاث قارات مع أكثر من 250 متطوعًا و60 منظمة شريكة.',
    ],
    titlePublications: 'منشورات أميل',
    listPublications: [
      '2022. استخدام التعلم العميق مع مجموعات البيانات المجمعة الكبيرة لتصنيف COVID-19 من السعال. arXiv: 2201.01669',
      '2021. استخدام حاسبة COVID-19 جديدة لقياس التأثير الاجتماعي والاقتصادي الإيجابي لحل فحص COVID-19 (AI/ML) في الولايات المتحدة. arXiv: 2201.11109',
      '2020. Virufy: القابلية العالمية للكشف عن COVID-19 من تسجيلات السعال باستخدام الذكاء الاصطناعي. arXiv: 2011.13320',
      '2020. Fusical: الدمج متعدد الوسائط للمشاعر في الفيديو. ACM ICMI; DOI: 3382507.3417966',
      '2020. التعرف على تعبيرات الوجه باستخدام التعلم العميق. arXiv: 2004.11823',
    ],
  },
};

export default amilsStory;
