import { type Footer } from '../types/footer';

const footer: Footer = {
  cookiePolicy: {
    title: 'سياسة الكوكيز',
    body: [
      {
        question: 'عام',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'text',
                text: 'تأسيس الكشف عن كوفيد ("فيروسفي"، "نحن"، "نا"، أو "خاصتنا")، مؤسسة غير ربحية في كاليفورنيا تقع في 4546، إل كامينو ريال، B10 #614، لوس ألتوس، الرمز البريدي 94022، الولايات المتحدة الأمريكية، تحترم خصوصيتك وهي ملتزمة بمعالجة معلوماتك الشخصية وفقًا للقانون. تشرح هذه السياسة ("السياسة") كيفية استخدام فيروسفي للكوكيز والتقنيات المماثلة لمعالجة المعلومات الشخصية التي تقدمها لنا عندما تزور موقعنا الإلكتروني (www.virufy.org) ("الموقع الإلكتروني") أو تشارك في استبيارنا البحثي من أجل تجميع مجموعة بيانات ضرورية لتطوير خوارزميات الذكاء الاصطناعي (AI) للكشف عن كوفيد-19 باستخدام الأجهزة.',
              },
            ],
          },

          {
            type: 'paragraph',
            content: [
              {
                type: 'text',
                text: 'بالنسبة للمستخدمين في:',
              },
            ],
          },
          {
            type: 'list',
            content: [
              {
                type: 'bold',
                text: 'أوروبا',
              },
              {
                type: 'text',
                text: ': سيتم التعامل مع هذه السياسة وفقًا للمقدمة 30 من اللائحة العامة لحماية البيانات الأوروبية 2016/679 (الـ "GDPR").',
              },
            ],
          },
          {
            type: 'list',
            content: [
              {
                type: 'bold',
                text: 'إسبانيا',
              },
              {
                type: 'text',
                text: ': سيتم التعامل مع هذه السياسة وفقًا للمقدمة 30 من اللائحة العامة لحماية البيانات الأوروبية 2016/679 (الـ "GDPR") ووفقًا للمادة 22 من القانون 34/2002، المؤرخ 11 يوليو، بشأن خدمات المجتمع المعلوماتي والتجارة الإلكترونية (LSSICE).',
              },
            ],
          },
          {
            type: 'list',
            content: [
              {
                type: 'bold',
                text: 'الأرجنتين',
              },
              {
                type: 'text',
                text: ': سيتم التعامل مع هذه السياسة وفقًا للقانون الأرجنتيني 25.326 بشأن حماية البيانات الشخصية.',
              },
            ],
          },
          {
            type: 'list',
            content: [
              {
                type: 'bold',
                text: 'البرازيل',
              },
              {
                type: 'text',
                text: ': سيتم التعامل مع هذه السياسة وفقًا للقانون العام لحماية البيانات الشخصية، الرقم 13.709 / 2018 في البرازيل (الـ "LGPD").',
              },
            ],
          },
          {
            type: 'list',
            content: [
              {
                type: 'bold',
                text: 'كولومبيا',
              },
              {
                type: 'text',
                text: ': سيتم التعامل مع هذه السياسة وفقًا للقانون الكولومبي 1581 لعام 2012.',
              },
            ],
          },
          {
            type: 'list',
            content: [
              {
                type: 'bold',
                text: 'الولايات المتحدة المكسيكية',
              },
              {
                type: 'text',
                text: ': سيتم اعتبار هذه السياسة جزءًا من إشعار الخصوصية الخاص بـ فيروسفي وسيتم التعامل معها وفقًا للقانون الفيدرالي لحماية البيانات الشخصية التي تحتفظ بها الأطراف الخاصة. في كل مرة يتم فيها الإشارة إلى "سياسة الخصوصية" في هذه الوثيقة، يتم فهم مصطلح "إشعار الخصوصية" على أنه مرادف.',
              },
            ],
          },
          {
            type: 'list',
            content: [
              {
                type: 'bold',
                text: 'بوليفيا',
              },
              {
                type: 'text',
                text: ': سيتم التعامل مع هذه السياسة وفقًا للقانون البوليفي.',
              },
            ],
          },
          {
            type: 'list',
            content: [
              {
                type: 'bold',
                text: 'بيرو',
              },
              {
                type: 'text',
                text: ': سيتم التعامل مع هذه السياسة وفقًا للقانون البيروفي.',
              },
            ],
          },
          {
            type: 'paragraph',
            content: [
              {
                type: 'text',
                text: 'فيروسفي هو "مسؤول البيانات" عن معلوماتك الشخصية المجمعة وفقًا لهذه السياسة الخاصة بالكوكيز. للحصول على مزيد من المعلومات حول كيفية استخدامنا وتخزيننا وكشفنا ومعالجتنا للبيانات الشخصية التي نحصل عليها من خلال أو في اتصال مع استخدام موقعنا الإلكتروني، يرجى زيارة سياسة الخصوصية الخاصة بنا.',
              },
            ],
          },
          {
            type: 'paragraph',
            content: [
              {
                type: 'text',
                text: 'عند وصولك إلى موقعنا الإلكتروني لأول مرة، ستتلقى رسالة تنبهك إلى أن الكوكيز والتقنيات المماثلة قيد الاستخدام. بالنقر على "استخدام الكوكيز الضرورية فقط" أو "السماح بكل الكوكيز"، فإنك تعبر عن فهمك ووافقتك على استخدام هذه التقنيات كما هو موضح في سياسة الكوكيز هذه.',
              },
            ],
          },
          {
            type: 'paragraph',
            content: [
              {
                type: 'text',
                text: 'إذا كان لديك أي استفسارات أو شكاوى بشأن سياسة الكوكيز الخاصة بنا، يرجى الاتصال بنا عبر البريد الإلكتروني على ',
              },
              {
                type: 'link',
                text: 'study@virufy.org',
                href: 'mailto:study@virufy.org',
              },
              {
                type: 'text',
                text: '. سيرد فريقنا عليك خلال 30 يوم عمل من استلام طلبك.',
              },
            ],
          },
        ],
      },
      {
        question: 'ما هي الكوكيز؟',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'text',
                text: 'الكوكيز هي ملفات نصية تحتوي على قطع صغيرة من البيانات التي يتم تخزينها على جهاز الكمبيوتر أو الجهاز المحمول الخاص بك كلما قمت بالوصول إلى موقع ويب. يتم استخدامها لجعل المواقع الإلكترونية تعمل بشكل أكثر كفاءة، وكذلك لتوفير المعلومات لمالكي الموقع. تعزز الكوكيز تجربة المستخدم من خلال السماح للمواقع الإلكترونية بقراءتها وكتابتها، مما يمكّنها من التعرف على الزوار وتذكر المعلومات المهمة التي تجعل استخدام الزائر للموقع الإلكتروني أكثر ملاءمة.',
              },
            ],
          },
          {
            type: 'paragraph',
            content: [
              {
                type: 'text',
                text: 'الكوكيز التي يتم تعيينها من قبل مالك الموقع الإلكتروني (في هذه الحالة، فيروسفي) تسمى "كوكيز الطرف الأول". الكوكيز التي يتم تعيينها من قبل أطراف أخرى غير مالك الموقع تسمى "كوكيز الطرف الثالث". تتيح الكوكيز من الطرف الثالث تقديم ميزات أو وظائف من طرف ثالث على الموقع الإلكتروني (مثل التحليلات).',
              },
            ],
          },
        ],
      },
      {
        question: 'كيف نستخدم الكوكيز؟',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'text',
                text: 'الكوكيز هي رسائل يمررها خوادم الويب إلى متصفحات الويب عند زيارة المواقع الإلكترونية. تستخدم الكوكيز في الغالب لتتبع نشاط المواقع الإلكترونية، لتتبع التسوق عبر الإنترنت، لتذكر تفضيلاتك، وتحسين تجربة المستخدم من خلال صفحات الويب الشخصية.',
              },
            ],
          },
          {
            type: 'paragraph',
            content: [
              {
                type: 'text',
                text: 'قد نستخدم الأنواع التالية من الكوكيز* لجعل الموقع الإلكتروني سهل الاستخدام:',
              },
            ],
          },
          {
            type: 'list',
            content: [
              {
                type: 'bold',
                text: 'كوكيز أساسية',
              },
              {
                type: 'text',
                text: ': قد يستخدم الموقع الإلكتروني كوكيز فنية للقيام بالأنشطة التي هي ضرورية بشكل صارم لعمل الموقع أو تقديم الخدمات. وتشمل، على سبيل المثال، الكوكيز التي تسمح لك بالوصول إلى المناطق الآمنة في الموقع. نستخدم هذه الكوكيز للحصول على الموافقة المطلوبة لمعالجة البيانات.',
              },
            ],
          },
          {
            type: 'list',
            content: [
              {
                type: 'bold',
                text: 'كوكيز التفضيلات',
              },
              {
                type: 'text',
                text: ': تمكّن هذه الكوكيز الموقع الإلكتروني من تذكر المعلومات التي تغير الطريقة التي يعمل بها الموقع أو يظهر، مثل اللغة المفضلة أو المنطقة التي تتواجد فيها.',
              },
            ],
          },
          {
            type: 'list',
            content: [
              {
                type: 'bold',
                text: 'كوكيز التحليلات',
              },
              {
                type: 'text',
                text: ': تتتبع هذه الكوكيز الأنشطة على الموقع الإلكتروني وتحلل كيفية استخدام الزوار لمحتوياتنا. نحن نستخدم هذه الكوكيز لفهم كيفية استخدام الموقع بشكل أفضل وتحسينه.',
              },
            ],
          },
          {
            type: 'list',
            content: [
              {
                type: 'bold',
                text: 'كوكيز الإعلان',
              },
              {
                type: 'text',
                text: ': تساعد هذه الكوكيز في تقديم الإعلانات التي تكون أكثر صلة بك. نستخدم هذه الكوكيز للتعرف على كيفية تفاعل المستخدم مع موقعنا لإظهار إعلانات ذات صلة.',
              },
            ],
          },
          {
            type: 'list',
            content: [
              {
                type: 'bold',
                text: 'كوكيز وسائل التواصل الاجتماعي',
              },
              {
                type: 'text',
                text: ': يستخدمها مزودي وسائل التواصل الاجتماعي مثل فيسبوك، تويتر، إلخ لتمكينك من التفاعل مع محتوى الموقع عبر شبكاتهم.',
              },
            ],
          },
        ],
      },
      {
        question: 'كيف يمكنك التحكم في الكوكيز؟',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'text',
                text: 'يحق لك التحكم في الكوكيز التي يتم تخزينها على جهازك. يمكنك تعديل إعدادات الكوكيز عبر متصفحك. يمكنك إيقاف تشغيل أو حذف الكوكيز عبر إعدادات المتصفح الخاص بك. قد تختلف الإجراءات الخاصة بكل متصفح، لكن معظم المتصفحات توفر خيارًا لإيقاف الكوكيز أو إعلامك عند وجود كوكيز جديدة.',
              },

              {
                type: 'text',
                text: ', ',
              },
              {
                type: 'link',
                text: 'Microsoft Edge',
                href: 'https://support.microsoft.com/en-us/help/10607/microsoft-edge-view-delete-browser-history',
              },
              {
                type: 'text',
                text: ', ',
              },
              {
                type: 'link',
                text: 'Microsoft Internet Explorer',
                href: 'https://support.microsoft.com/en-gb/help/17442/windows-internet-explorer-delete-manage-cookies',
              },
              {
                type: 'text',
                text: ', ',
              },
              {
                type: 'link',
                text: 'Mozilla Firefox',
                href: 'https://support.mozilla.org/en-US/kb/enable-and-disable-cookies-website-preferences',
              },
              {
                type: 'text',
                text: ', ',
              },
              {
                type: 'link',
                text: 'Opera',
                href: 'https://blogs.opera.com/news/2015/08/how-to-manage-cookies-in-opera/',
              },
            ],
          },
        ],
      },
      {
        question: 'التعديلات على سياسة الكوكيز هذه',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'text',
                text: 'قد نقوم بتحديث سياسة الكوكيز هذه من وقت لآخر لتعكس، على سبيل المثال، التغييرات في الكوكيز التي نستخدمها أو لأسباب تشغيلية أو قانونية أو تنظيمية أخرى. وبما أننا لا نجمع بيانات شخصية مثل عنوان IP الخاص بك أو بريدك الإلكتروني أو أي وسيلة اتصال أخرى، وبالتالي ليس لدينا وسيلة للتواصل معك من أجل سلامتك، يُرجى زيارة سياسة الكوكيز هذه بانتظام للبقاء على اطلاع حول استخدامنا للكوكيز والتقنيات ذات الصلة.',
              },
            ],
          },
          {
            type: 'paragraph',
            content: [
              {
                type: 'text',
                text: 'التاريخ الموجود في أعلى سياسة الكوكيز هذه يشير إلى آخر مرة تم تحديثها فيها.',
              },
            ],
          },
        ],
      },
      {
        question: 'كيف يمكنك الاتصال بنا مع أي استفسارات؟',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'text',
                text: 'إذا كانت لديك أي مخاوف تتعلق باستخدامنا للكوكيز أو التقنيات الأخرى، يرجى الاتصال بنا على ',
              },
              {
                type: 'link',
                text: 'study@virufy.org',
                href: 'mailto:study@virufy.org',
              },
              {
                type: 'text',
                text: '.',
              },
            ],
          },
        ],
      },
    ],
  },
  privacyPolicy: {
    title: 'سياسة الخصوصية',
    body: [
      {
        question: 'الأرجنتين',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'link',
                text: 'سياسة الخصوصية',
                href: 'https://drive.google.com/file/d/1Fef7l77QP3EZboej6mw_q7fBNrayvs03/view',
              },
            ],
          },
        ],
      },
      {
        question: 'بوليفيا',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'link',
                text: 'سياسة الخصوصية',
                href: 'https://drive.google.com/file/d/1ZSrRivk4YJyyDioqYeAsz0fgNAP3UwVn/view',
              },
            ],
          },
        ],
      },
      {
        question: 'البرازيل',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'link',
                text: 'سياسة الخصوصية',
                href: 'https://drive.google.com/file/d/1Zl9QO-Dliik84xjuXCdFGcDOk5GytXr1/view',
              },
            ],
          },
        ],
      },
      {
        question: 'كولومبيا',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'link',
                text: 'سياسة الخصوصية',
                href: 'https://drive.google.com/file/d/1eQOx81C5e5CoESYsEnrE9sWhCkTMDPEq/view',
              },
            ],
          },
        ],
      },
      {
        question: 'اليونان',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'link',
                text: 'سياسة الخصوصية',
                href: 'https://drive.google.com/file/d/1lMVygBx3pV_lZBhFtZe5go4UM4mFt0qP/view',
              },
            ],
          },
        ],
      },
      {
        question: 'المكسيك',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'link',
                text: 'سياسة الخصوصية',
                href: 'https://drive.google.com/file/d/1Qr3cFttfhjUoKxLcQrVEhsuO-OJ6VE0_/view',
              },
            ],
          },
        ],
      },
      {
        question: 'بيرو',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'link',
                text: 'سياسة الخصوصية',
                href: 'https://drive.google.com/file/d/1UgN2Bu2XIvv2YirLRYloSPlbYln_uzf9/view',
              },
            ],
          },
        ],
      },
      {
        question: 'الولايات المتحدة',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'link',
                text: 'سياسة الخصوصية',
                href: 'https://drive.google.com/file/d/1EB_9q8nSxvJXWMtCfxCWmisM-n03TJYz/view',
              },
            ],
          },
        ],
      },
      {
        question: 'أوروبا',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'link',
                text: 'سياسة الخصوصية',
                href: 'https://drive.google.com/file/d/1EB_9q8nSxvJXWMtCfxCWmisM-n03TJYz/view',
              },
            ],
          },
        ],
      },
      {
        question: 'اليابان',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'link',
                text: 'سياسة الخصوصية',
                href: 'https://drive.google.com/file/d/11RTMmnHW4SqHNf7htr3xuSi-o2v2vWlp/view',
              },
            ],
          },
        ],
      },
      {
        question: 'دول أخرى',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'link',
                text: 'سياسة الخصوصية',
                href: 'https://drive.google.com/file/d/1hnxvDJ5qHBnUi7cnkNdyD4PuWMz8Ntss/view',
              },
            ],
          },
        ],
      },
    ],
  },
  personalInfo: {
    title: 'لا تبيع معلوماتي الشخصية',
    body: [
      {
        question: 'حقوق قانون خصوصية المستهلك في كاليفورنيا',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'text',
                text: 'يحق للمستهلكين في كاليفورنيا المعرفة والوصول وحذف معلوماتهم الشخصية بموجب قانون خصوصية المستهلك في كاليفورنيا. يحق للمستهلكين في كاليفورنيا أيضًا اختيار عدم بيع معلوماتهم الشخصية من قبل الشركات، ويحق لهم عدم التعرض للتمييز بسبب ممارسة حقوقهم في الخصوصية في كاليفورنيا. لا تبيع فيروفي معلومات المستهلكين الشخصية في كاليفورنيا ولا تميز ردًا على طلبات حقوق الخصوصية.',
              },
            ],
          },
        ],
      },
      {
        question:
          'تقدم فيروفي إشعارًا بممارسات الخصوصية في سياسة الخصوصية الخاصة بنا',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'text',
                text: 'تتضمن سياسة الخصوصية ما هي المعلومات الشخصية والبيانات التي يتم جمعها، مصدر المعلومات الشخصية والبيانات التي تم جمعها، كيفية معالجة وتخزين المعلومات الشخصية والبيانات، وأغراض استخدام المعلومات الشخصية. تكشف فيروفي أيضًا عن المعلومات الشخصية وإذا كان الأمر كذلك، الفئات التي يتم الكشف عن البيانات والمعلومات الشخصية لها. يتم تقديم مزيد من المعلومات حول كيفية تعامل فيروفي مع المعلومات الشخصية في إطار خدمات فيروفي المحددة في إشعارات خاصة بالخدمة عند أو قبل أول استخدام لتطبيق فيروفي الإلكتروني ومتاح في أي وقت. للاطلاع على نسخة من أحدث الإصدارات من إشعارات الخصوصية الخاصة بالخدمات والإفصاحات الخاصة بكاليفورنيا، يرجى مراجعة سياسة الخصوصية الخاصة بنا.',
              },
            ],
          },
        ],
      },
      {
        question: 'كيفية ممارسة الحقوق المذكورة أعلاه',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'text',
                text: 'يمكن للمستهلكين في كاليفورنيا ممارسة حقوقهم في الوصول إلى معلوماتهم أو حذفها مباشرة أو من خلال وكيل مفوض من خلال الاتصال بـ فيروفي على ',
              },
              {
                type: 'link',
                text: 'study@virufy.org',
                href: 'mailto:study@virufy.org',
              },
              {
                type: 'text',
                text: '. ستطلب فيروفي منك معلومات تعتبرها ضرورية للتحقق من هويتك من أجل الأمان ولمنع الاحتيال. قد تتضمن هذه المعلومات الاسم، معلومات الاتصال، والمعلومات المتعلقة بعلاقتك مع فيروفي، ولكن قد يختلف نوع المعلومات المطلوبة حسب ظروف طلبك من أجل الأمان وحماية حقوق الخصوصية. إذا قمنا بحذف معلوماتك الشخصية، سنجعل بعض المعلومات الشخصية غير قابلة للاسترداد بشكل دائم ونقوم أيضًا بإزالة تعريف بعض المعلومات الشخصية.',
              },
            ],
          },
        ],
      },
      {
        question: 'التسويق المباشر وعدم التتبع',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'text',
                text: 'لا تقوم فيروفي بتتبع عملائها عبر الزمن وعلى مواقع الويب الخاصة بالأطراف الثالثة لتقديم إعلانات موجهة، وبالتالي لا تستجيب لإشارات متصفح الويب الخاصة بـ "عدم التتبع". إذا وصلت إلى موقعنا الإلكتروني عبر رابط من موقع طرف ثالث يستجيب لطلبات "عدم التتبع"، فإن التعرف على أي طلب "عدم تتبع" قد بدأته سينتهي بمجرد وصولك إلى موقعنا الإلكتروني. لا يمكن للأطراف الثالثة جمع أي معلومات شخصية قابلة للتحديد من مواقع فيروفي الإلكترونية ما لم تقدمها لهم مباشرة. يتم وصف هذا أيضًا في سياسة الخصوصية الخاصة بنا.',
              },
            ],
          },
        ],
      },
      {
        question: 'إشعار للقاصرين',
        answer: [
          {
            type: 'paragraph',
            content: [
              {
                type: 'text',
                text: 'نحن لا نجمع عن علم معلومات عبر الإنترنت من الأطفال دون سن 18 عامًا. إذا تم إخطارنا أننا جمعنا معلومات شخصية، كما هو معرف في قانون حماية خصوصية الأطفال عبر الإنترنت (COPPA)، لطفل تحت سن 13 عامًا، فإننا سنقوم بحذف المعلومات بأسرع وقت ممكن. نحن لا نبيع أبدًا المعلومات الشخصية للقاصرين دون سن 18 عامًا ولن نفعل ذلك في المستقبل دون إذن صريح من المستهلك إذا كان عمره بين 13 و16 عامًا، أو من الوالد أو الوصي على المستهلك الذي يقل عمره عن 13 عامًا.',
              },
            ],
          },
        ],
      },
    ],
  },
  nonProfitSection: {
    title: 'الصفة غير الربحية',
    textOne:
      'فيروفي هي مؤسسة غير ربحية في كاليفورنيا معترف بها من قبل دائرة الإيرادات الداخلية الأمريكية (IRS) كمنظمة خيرية معفاة من الضرائب بموجب القسم 501(c)(3) من قانون الإيرادات الداخلية.',
    textTwo:
      '©2025 فيروفي | فيروفي هي علامة تجارية لمؤسسة الكشف عن كوفيد، وهي مؤسسة غير ربحية في كاليفورنيا | جميع الحقوق محفوظة',
  },
};

export default footer;
