import { type Ai } from '../types/ai';

const Ai: Ai = {
  heroSection: {
    tag: 'التكنولوجيا الصحية المدعومة بالذكاء الاصطناعي',
    title: [
      { type: 'text', text: 'ال' },
      { type: 'span', text: 'علم' },
      { type: 'text', text: ' وراء Virufy' },
    ],
    text: 'تستمع تقنية الذكاء الاصطناعي لدينا إلى الأنماط الدقيقة في صوت السعال، مما يساعد على اكتشاف أمراض الجهاز التنفسي المحتملة في وقت مبكر وغير جراحي.',

    aiSlides: [
      {
        title: 'جمع البيانات',
        text: 'ما عليك سوى تسجيل سعال قصير باستخدام تطبيق الويب سهل الاستخدام. ترشدك الواجهة إلى التقاط عينة سعال طبيعية عالية الجودة في ظل ظروف متسقة، مما يضمن الصوت الأمثل لإجراء تحليل دقيق للجهاز التنفسي.',
        image: '/images/ai/carousel-image-1.webp',
      },
      {
        title: 'معالجة الإشارات',
        text: 'نحن نستخدم خوارزميات التعلم الآلي لتحديد أصوات السعال وعزلها بدقة. تعمل أدواتنا على تنظيف الضوضاء في الخلفية وتحليل المؤشرات الحيوية الرقمية عن طريق تحويل الموجات الصوتية إلى خصائص قابلة للقياس الكمي تسمى ميزات العلامات الحيوية الصوتية.',
        image: '/images/ai/carousel-image-2.webp',
      },
      {
        title: 'تحليل التعلم الآلي',
        text: 'يتم بعد ذلك إدخال ميزات العلامات الحيوية الصوتية المستخرجة في نموذج التعلم الآلي المُدرب مسبقًا، حيث يقارن النموذج خصائص السعال الوارد الجديدة مع الأنماط التي تعلمها من خلال التدريب.',
        image: '/images/ai/carousel-image-3.webp',
      },
    ],
  },

  aiSection: {
    title: 'كيف يتعلم الذكاء الاصطناعي لدى Virufy',
    text: 'الذكاء الاصطناعي (AI) قادر على اكتشاف الاختلافات الدقيقة في الأنماط الصوتية للكشف عن وجود المرض. تقوم الخوارزمية بفحص العناصر المختلفة للسعال، مثل المدة والتكرار ودرجة الصوت. ومن خلال الاستفادة من قاعدة بيانات شاملة، يقارن الذكاء الاصطناعي بدقة أنماط السعال المسجلة مع المؤشرات المعروفة لأمراض الجهاز التنفسي، مما يسمح بالكشف المبكر عن المشكلات الصحية المحتملة.',

    aiCards: [
      {
        title: 'التقاط الصوت',
        text: 'يسجل المستخدمون عينات سعال قصيرة ومجهولة المصدر من خلال تطبيق Virufy.',
        icon: '/icons/icon-ai-sound.png',
        style: 'shadow-xl w-full h-full',
      },
      {
        title: 'المعالجة الصوتية',
        text: 'يتم تحويل كل سعال إلى خريطة صوتية مرئية، أو مخطط طيفي.',
        icon: '/icons/icon-ai-acoustic.png',
        style: 'shadow-xl h-full',
      },
      {
        title: 'استخراج الميزة',
        text: 'يحدد الذكاء الاصطناعي الأنماط الدقيقة والمؤشرات الحيوية الصوتية في البيانات.',
        icon: '/icons/icon-ai-feature.png',
        style: 'shadow-xl w-full h-full',
      },
      {
        title: 'التدريب النموذجي',
        text: 'تتعلم الخوارزميات من مجموعات البيانات العالمية لتحسين الدقة والعدالة.',
        icon: '/icons/icon-ai-model.png',
        style: 'shadow-xl h-full',
      },
      {
        title: 'التحقق من الصحة والبصيرة',
        text: 'يتم اختبار نتائج المستخدمين لضمان التحسين المستمر والفعالية.',
        icon: '/icons/icon-ai-validation.png',
        style: 'shadow-xl w-full h-full',
      },
    ],
  },

  banner: {
    title: 'هل أنت مستعد لإحداث فرق؟',
    text: 'نحن في مهمة لجعل الفحص الصحي بسيطًا مثل السعال. تواصل معنا لتعرف كيف تعمل مساهماتك المالية على تسريع أبحاثنا السريرية بشكل مباشر ونشر تكنولوجيا الذكاء الاصطناعي التي يمكن الوصول إليها للمجتمعات في جميع أنحاء العالم.',
    buttonText: 'ادعمنا',
    url: '/donate',
  },
};

export default Ai;
