import { type Ai } from '../types/ai';

const ai: Ai = {
  heroSection: {
    title: [
      {
        type: 'text',
        text: 'العلم وراء ',
      },
      {
        type: 'span',
        text: 'Virufy',
      },
    ],
    text: 'يمكن للذكاء الاصطناعي (AI) تحديد الفروقات الدقيقة في أصوات السعال والتنفس المرتبطة بأمراض الجهاز التنفسي.',
    url: '/publications',
    linkText: 'أبحاثنا',
  },
  aiSection: {
    title: 'كيف يعمل الذكاء الاصطناعي؟',
    aiCards: [
      {
        title: '01',
        text: 'يستخدم تطبيقنا المبتكر تقنية الذكاء الاصطناعي المتقدمة لتحليل أصوات السعال والتنفس باستخدام خوارزميات التعلم العميق وتقنيات معالجة الإشارات الصوتية.',
        style: 'tracking-widest text-[2.5rem] sm:text-6xl',
      },
      {
        title: '02',
        text: 'تقوم الخوارزمية بفحص عناصر مختلفة من السعال مثل المدة والتردد ودرجة الصوت. وبالاعتماد على قاعدة بيانات شاملة، تقوم الذكاء الاصطناعي بمقارنة أنماط السعال المسجلة بدقة مع المؤشرات المعروفة لأمراض الجهاز التنفسي، مما يسمح بتحديد الإشارات المرتبطة بالحالات التنفسية.',
        style: 'text-[2.5rem] sm:text-6xl',
      },
    ],
  },
};

export default ai;
