import { type CookieModal } from '../types/cookiemodal';

const cookieModal: CookieModal = {
  text: 'نصل إلى معلومات غير حساسة من جهازك ونخزنها، مثل ملفات تعريف الارتباط أو مُعرّف الجهاز الفريد، ونعالج البيانات الشخصية، مثل نحن نصل إلى المعلومات غير الحساسة ونخزنها من جهازك، مثل ملفات تعريف الارتباط أو معرف الجهاز الفريد، ونعالج البيانات الشخصية مثل عناوين IP لأغراض التحليل. يمكنك إلغاء الاشتراك في معالجة البيانات التي ليست ضرورية للوظيفة الأساسية لهذا الموقع من خلال النقر على "رفض وإغلاق" في هذه النافذة.',
  yes: 'قبول وإغلاق',
  no: 'رفض وإغلاق',
};
export default cookieModal;
