import {
  BgHeader,
  GlobeIcon,
  MonitorIcon,
  PhoneInHandIcon,
  PrivacyIcon,
  QuestionMarkIcon,
  RecycleIcon,
  SearchIcon,
} from '@/public/images/faq';

import { type FAQ } from '../types/faq';

const faq: FAQ = {
  headerSection: {
    img: BgHeader,
    altText: '',
    title: [
      {
        type: 'text',
        text: 'كيف يمكننا ',
      },
      {
        type: 'span',
        text: 'مساعدتك ',
      },
      {
        type: 'text',
        text: '؟',
      },
    ],
    input: {
      placeholder: 'ابدأ الكتابة للبحث...',
      img: SearchIcon,
      altText: 'أيقونة البحث',
    },
    texts: [
      {
        type: 'text',
        text: 'أو ',
      },
      {
        type: 'span',
        text: 'اختر ',
      },
      {
        type: 'text',
        text: 'خياراً أدناه لمساعدتك في العثور على ما تبحث عنه.',
      },
    ],
  },
  topicsSection: {
    title: 'مواضيع الأسئلة الشائعة',
    cards: [
      {
        title: 'تطبيق Virufy',
        img: PhoneInHandIcon,
        altText: '',
      },
      {
        title: 'حول Virufy',
        img: GlobeIcon,
        altText: '',
      },
      {
        title: 'حول الذكاء الاصطناعي',
        img: RecycleIcon,
        altText: '',
      },
      {
        title: 'الشؤون المالية',
        img: MonitorIcon,
        altText: '',
      },
      {
        title: 'الخصوصية',
        img: PrivacyIcon,
        altText: '',
      },
      {
        title: 'أخرى',
        img: QuestionMarkIcon,
        altText: '',
      },
    ],
  },
  questionsSection: {
    topicTitle: 'الأسئلة الشائعة',
    noResultsTitle: 'لم يتم العثور على نتائج',
    questionsByTopic: {
      'تطبيق Virufy': [
        {
          question: 'متى وكيف ستعرض التطبيق نتائج توقعات COVID-19؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'تطبيقنا حالياً مخصص لجمع البيانات فقط. لا يمكننا إصدار تطبيق لتوقع COVID-19 بدون موافقات إدارات الصحة العامة في كل بلد ودراسات سريرية للتحقق من صحة تقنية الذكاء الاصطناعي في الظروف المحلية. قد يستغرق هذا بضعة أسابيع أو أشهر بناءً على سرعة الشركاء الحكوميين. Virufy يرحب بالشراكات مع المسؤولين الصحيين والمستشفيات لتوفير التقنية للاستخدام المجاني وتحسين استخدام اختبارات PCR المكلفة عند الضرورة.',
                },
              ],
            },
          ],
        },
        {
          question:
            'هل تطبيقك متوفّر على iOS أو الأندرويد؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'تطبيقنا مصمّم كتطبيق عبر الإنترنت لذا يمكن استخدامه من متصفّح الإنترنت على أيّ جهاز محمول، ولا يتطلّب تحميلاً أو تثبيتاً منفصلاً.',
                },
              ],
            },
          ],
        },
        {
          question: 'هل سيكون التطبيق متاحاً مجاناً وعلى مستوى العالم؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'باعتبارنا منظمة غير ربحية (501(c)(3))، نعتزم جعل التطبيق مجانياً لفائدة البلدان ذات الدخل المنخفض. ومع ذلك، قد نحتاج إلى فرض رسوم رمزية لدعم عملياتنا في حالة عدم تمكننا من جمع التبرعات الكافية.',
                },
              ],
            },
          ],
        },
        {
          question: 'هل تخططون لتحويل هذا التطبيق إلى مشروع ربحي؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'Virufy هي منظمة غير ربحية. قد نتعاون مع شركات إذا لزم الأمر لتسريع نشر التطبيق لصالح الناس.',
                },
              ],
            },
          ],
        },
      ],
      'حول Virufy': [
        {
          question: 'كيف تم إنشاء هذه المبادرة؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'عندما ضربت الجائحة، كان مؤسس Virufy، أميل، يعلم أن الهواتف الذكية منتشرة وأن COVID يؤثر على الأنف والحلق والرئتين. افترض أن أصوات التنفس والسعال يمكن تحليلها باستخدام التعلم الآلي للكشف عن أنماط COVID. لرغبته في تحقيق تأثير إيجابي، نظم دراسة سريرية مع 362 مريضاً في مستشفى جامعي مرموق...',
                },
              ],
            },
          ],
        },
        {
          question:
            'كيف يختلف Virufy عن المجموعات الأخرى التي تعمل على مشاريع مشابهة؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'لأن Virufy هي منظمة غير ربحية معفاة من الضرائب وفقًا للمادة 501(c)(3)، فإننا قادرون على استقطاب محترفين ذوي كفاءة عالية للعمل كمتطوعين. فريقنا عالمي، يمتد عبر خمس قارات، وبالتالي فإن منظمتنا مفعمة بالتعاطف العالمي. نحن غير مهتمين بتحقيق الربح، مما يسمح لنا بالعمل في الدول النامية. شبكات خريجي الجامعات والمهنية الكثيفة لدينا تمنحنا إمكانية الوصول إلى جهات اتصال على أعلى المستويات في كل بلد في العالم. الإرشاد جزء من منظمتنا، حيث يستفيد العشرات من المهنيين الشباب في فريقنا من النصائح الحكيمة التي يقدمها خبراء كبار في الصناعة، مما يؤدي إلى نشاط سريع وإبداعي يركز في الاتجاه الصحيح.',
                },
              ],
            },
          ],
        },
        {
          question:
            'ما هي المرحلة التي وصلتم إليها في التحقيق؟ وهل هناك موعد نهائي للمشاركة؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'لقد بذلنا جهدًا كبيرًا لتكوين شراكات، وبناء تطبيقنا للهواتف المحمولة، وتسجيل منظمتنا غير الربحية في ولاية كاليفورنيا، ووضع سياساتنا للامتثال لقوانين خصوصية البيانات في عشرات الدول. تطبيق جمع البيانات لدينا في مرحلة متقدمة، حيث قمنا بمعالجة معظم مخاوف خصوصية بيانات الرعاية الصحية والتقنية اللازمة لإطلاقه. لقد وضعنا بالفعل خصوصية البيانات، وأمن المعلومات، وتجربة المستخدم وواجهة المستخدم في مكانها المناسب لتطبيق جمع البيانات المحمول، بالإضافة إلى بنية خلفية قابلة للتوسع على AWS. لقد جمعنا كميات كبيرة من البيانات تجاوزت 250,000 مريض، وبمساعدة الذكاء الاصطناعي نبني الحل. لا يوجد موعد نهائي، ونرحب دائمًا بالشركاء الذين يمكنهم تقديم تمويل المنح، أو خدمات التطوع، أو جمع بيانات سريرية.',
                },
              ],
            },
          ],
        },
        {
          question: 'ما الذي يميز Virufy عن المشاريع الأخرى؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'بصفتنا منظمة شابة تضم فريقًا متنوعًا وعالميًا من خريجي أكثر من 25 جامعة، فإننا نسترشد بمستوى عالٍ من المحترفين في الصناعة. فريقنا متعدد التخصصات لديه خبرة في القانون، التعلم الآلي، الطب، أمن المعلومات، وتطوير تطبيقات الهاتف المحمول. شبكتنا التابعة لمنظمة One Young World تتيح لنا التواصل مع شركاء موثوقين في كل دولة. نرحب بالجميع، وكوننا منظمة غير ربحية معفاة من الضرائب يسمح للمتطوعين بالانضمام. بصفتنا منظمة غير ربحية يديرها متطوعون، نحن مستقلون ولدينا قدر أقل من التعقيدات الإدارية.',
                },
              ],
            },
          ],
        },
        {
          question: 'كم من الاستثمار تم بذله لجعل مشروع Virufy ممكنًا؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'أكثر من 1,000 متطوع قدموا آلاف الساعات لجعل المشروع ممكنًا. قدمت العديد من الشركات دعمها لنا من خلال برامج مجانية، بما في ذلك البريد الإلكتروني، والتخزين، ومنصات الرسائل، بالإضافة إلى خدمات الحوسبة السحابية. بعض البرامج مثل مؤتمرات الفيديو وأدوات إدارة المشاريع لم تكن مجانية، وللأسف تم دفع تكلفتها من مدخرات مؤسس المشروع أمل المحدودة. نعتقد أنه إذا نجحنا، ستزداد تكاليف الحوسبة السحابية لدينا، لكننا سنتمكن من جذب تمويل كافٍ من المنح والتبرعات الخاصة، بالإضافة إلى دعم حكومي للحفاظ على نظامنا قيد التشغيل.',
                },
              ],
            },
          ],
        },
      ],
      'حول الذكاء الاصطناعي': [
        {
          question: 'لماذا يمكن تمييز السعال المرتبط بكوفيد-19؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'على غرار الأمراض التنفسية الأخرى، يسبب كوفيد-19 تلفًا في الحلق والرئتين، مما يؤدي إلى تغييرات يمكن اكتشافها في أنماط السعال. وبالتالي، يمكن تحليل أصوات السعال للكشف عن كوفيد-19 وأمراض الجهاز التنفسي العلوي الأخرى. عالميًا، يتم البحث في هذه الفكرة بشكل نشط من قبل العديد من المؤسسات المرموقة، بما في ذلك جامعة كارنيجي ميلون (CMU)، ومعهد ماساتشوستس للتكنولوجيا (MIT)، وجامعة كامبريدج. على سبيل المثال، أظهرت أبحاث أجرتها جامعة كامبريدج أن مُصنِّفًا بسيطًا يعتمد على التعلم الآلي يمكنه تصنيف مرضى كوفيد-19 الإيجابيين من خلال أصوات التنفس والسعال بدقة عالية. وبالمثل، حدد الباحثون في CMU 18 ميزة صوتية تميز مرضى كوفيد-19 الإيجابيين ودربوا نموذجًا أكاديميًا لاكتشاف المرض بدقة عالية.',
                },
              ],
            },
          ],
        },
        {
          question:
            'ما هي الصعوبة الرئيسية في جمع ومعالجة البيانات؟ وهل كانت هناك مناطق كانت فيها دقة الذكاء الاصطناعي أقل، على سبيل المثال؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'تعتبر العملية بطيئة وشاقة عند جمع البيانات من المستشفيات، حيث تتطلب استمارات دراسات سريرية وموافقات من لجان المراجعة المؤسسية (IRB). بإشراف مستشارين طبيين من جامعات مختلفة، بما في ذلك هارفارد وستانفورد، قمنا بتسجيل أكثر من 250,000 مريض في دراساتنا السريرية في 5 دول. لجمع البيانات مباشرة من المستخدمين، بذلنا جهودًا كبيرة مع محامين خبراء يقدمون خدماتهم بشكل تطوعي لضمان الامتثال لقوانين خصوصية البيانات، بما في ذلك LGPD، GDPR، وCCPA. كما هو موضح في ورقتنا البحثية، تضمنت بعض الصعوبات التي واجهناها أثناء معالجة البيانات وجود ضوضاء خلفية مفرطة وتسجيلات سعال غير صحيحة مقدمة من المستخدمين، مما اضطر مطوري الذكاء الاصطناعي إلى تنظيف العينات الصوتية يدويًا قبل تدريب النماذج.',
                },
              ],
            },
          ],
        },
        {
          question: 'هل يمكن اكتشاف الحالات غير العرضية؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'نعم، لقد أظهرت الأبحاث التي أجراها معهد ماساتشوستس للتكنولوجيا (MIT) ومجموعات أخرى إمكانية اكتشاف الحالات غير العرضية. هذا مهم بشكل خاص للأشخاص في العشرينات والثلاثينات من أعمارهم الذين هم أكثر عرضة لأن يكونوا دون أعراض.',
                },
              ],
            },
          ],
        },
        {
          question:
            'هل ستستخدم التطبيق ذكاء اصطناعي تم تطويره من قبل أطراف ثالثة أم تم إنشاؤه خصيصًا لهذا الغرض؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'يمتلك Virufy فريقًا خاصًا بالبحث في مجال الذكاء الاصطناعي مع تقنيات مسجلة ببراءات اختراع. نحن منفتحون على التعاون، والتطوير المشترك، ودمج خوارزميات الذكاء الاصطناعي من مجموعات بحثية أخرى.',
                },
              ],
            },
          ],
        },
      ],
      'الشؤون المالية': [
        {
          question: 'هل أحتاج إلى تقديم مساهمة مالية للتبرع بسعالي؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'حاليًا، يقوم Virufy بجمع السعال فقط من بعض البلدان، والتي يمكن العثور عليها في تطبيقنا: ',
                },
                {
                  type: 'link',
                  text: 'https://virufy.org/study',
                  href: 'https://virufy.org/study',
                },
                {
                  type: 'text',
                  text: '.',
                },
              ],
            },
          ],
        },
        {
          question: 'هل يجب أن أعاني من أعراض السعال للتبرع بسعالي؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'لا، التطبيق متوافق أيضًا مع السعال الإجباري.',
                },
              ],
            },
          ],
        },
        {
          question: 'كم عدد المتبرعين الذين حصلتم عليهم إجمالاً؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'لدينا أكثر من 5,000 تسجيل للسعال من أكثر من 10 دول، معظمها في أمريكا الجنوبية وجنوب آسيا. بعضها تسجيلات سريرية، والبعض الآخر ساهم بها الأفراد مباشرةً عبر تطبيقنا.',
                },
              ],
            },
          ],
        },
        {
          question: 'ما هي النفقات التشغيلية للمنظمة؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'نحن حالياً نعمل بالكامل من خلال المتطوعين. تتطلب ميزانيتنا بشكل رئيسي التسويق والدراسات السريرية لجمع بيانات السعال. كما سنحتاج إلى ميزانية للتشغيل الحسابي لاحقًا بعد التوسع إلى قاعدة مستخدمين كبيرة.',
                },
              ],
            },
          ],
        },
        {
          question:
            'هل تحصلون على تمويل؟ إذا كان كذلك، من أين وكم؟ وعلى ماذا يُنفق؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'نحن نتعاون مع العديد من الجامعات للتقديم على منح البحث والتطوير (R&D) بالاعتماد على وضعنا كمنظمة غير ربحية 501(c)(3).',
                },
              ],
            },
          ],
        },
      ],
      الخصوصية: [
        {
          question: 'كيف سيقوم Virufy بتخزين بياناتي بأمان؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'نستخدم خدمات Amazon Web Services (AWS) لجمع بيانات الدراسات البحثية. تقوم AWS بتخزين البيانات في تطبيق آمن مع وصول محدود وتحكمات صارمة. سيتم تخزين بياناتك مع AWS حتى نقوم بتنزيلها. سنقوم بتخزين البيانات في قاعدة بيانات ذات وصول مقيد. إذا كنت ترغب في معرفة المزيد عن كيفية تخزين AWS لبياناتك، يرجى زيارة سياسة الخصوصية الخاصة بهم على ',
                },
                {
                  type: 'link',
                  text: 'https://aws.amazon.com/en/privacy',
                  href: 'https://aws.amazon.com/en/privacy',
                },
                {
                  type: 'text',
                  text: '. إذا كنت تريد معرفة المزيد، يرجى الرجوع إلى سياسة الخصوصية الخاصة بـ Virufy.',
                },
              ],
            },
          ],
        },
        {
          question: 'هل هناك خطر على خصوصيتي إذا تبرعت بسعالي إلى Virufy؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'قام فريقنا القانوني وفريق أمن المعلومات بتطوير تقييم تأثير حماية البيانات (DPIA) لمعالجة المخاطر والتهديدات المحتملة لخصوصيتك. سنقوم بتخزين بياناتك الشخصية في شكل مجهول (حيث لا يمكن تحديد هويتك بأي شكل من الأشكال) وفي قاعدة بيانات آمنة ذات وصول محدود. إذا كنت تريد معرفة المزيد، يرجى الرجوع إلى سياسة الخصوصية الخاصة بـ Virufy.',
                },
              ],
            },
          ],
        },
        {
          question: 'هل لدى Virufy سياسة خصوصية وسياسة ملفات تعريف الارتباط؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'تأخذ Virufy خصوصية وحماية معلوماتك الشخصية على محمل الجد. قام فريقنا القانوني بإعداد سياسة خصوصية مفصلة وسياسة ملفات تعريف الارتباط لحماية المعلومات الشخصية التي تشاركها معنا من خلال استخدام موقعنا الإلكتروني والمشاركة في دراسة التبرع بالسعال والاتصال بنا وطلبات التطوع. ارجع إلى التذييل للحصول على سياسة الخصوصية وسياسة ملفات تعريف الارتباط التفصيلية.',
                },
              ],
            },
          ],
        },
        {
          question: 'هل سيتم مشاركة بياناتي مع أطراف ثالثة؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'إذا قمت بالموافقة على مشاركة معلومات الاتصال الخاصة بك (مثل البريد الإلكتروني ورقم الهاتف) معنا، فلن نقوم بتوزيع أي من هذه المعلومات الشخصية على أي طرف ثالث. ومع ذلك، قد نشارك معلوماتك المجهولة، مثل تسجيلات السعال الخاصة بك، مع أطراف ثالثة لتسريع جهود البحث العالمية لوقف انتشار COVID-19 والأمراض الأخرى في المستقبل. يمكن العثور على مزيد من التفاصيل في سياسة الخصوصية الخاصة بنا ونموذج الموافقة لدراسة جمع البيانات.',
                },
              ],
            },
          ],
        },
      ],
      أخرى: [
        {
          question: 'كيف يمكنني دعم Virufy بشكل أكبر؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'يمكنك الانضمام إلى فريقنا اليوم والاطلاع على صفحة ',
                },
                {
                  type: 'relative-link',
                  text: 'قائمة الوظائف',
                  href: '/job-listing',
                },
                {
                  type: 'text',
                  text: ' لمزيد من المعلومات. يمكنك أيضًا دعمنا عبر GoFundMe أو التواصل معنا للشراكة.',
                },
              ],
            },
          ],
        },
        {
          question: 'كيف تعمل عملية التوزيع، وكيف سيصبح Virufy أكثر انتشارًا؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'سيتم تقديم التطبيق لصالح الناس في البلدان ذات الدخل المنخفض، ومن المحتمل أن يُسوِّق نفسه وينتشر بسرعة.',
                },
              ],
            },
          ],
        },
        {
          question: 'ماذا لو كانت لدي المزيد من الأسئلة؟',
          answer: [
            {
              type: 'paragraph',
              content: [
                {
                  type: 'text',
                  text: 'يمكن العثور على مزيد من التفاصيل في سياسة الخصوصية الكاملة الخاصة بنا، وسياسة ملفات تعريف الارتباط، ونموذج الموافقة المدمج في تطبيق جمع البيانات. للاستفسارات المتعلقة بدراسة جمع البيانات، يرجى مراسلتنا عبر البريد الإلكتروني على ',
                },
                {
                  type: 'link',
                  text: 'study@virufy.org',
                  href: 'mailto:study@virufy.org',
                },
                {
                  type: 'text',
                  text: '. للاستفسارات المتعلقة بالبيانات، يمكنكم التواصل معنا عبر ',
                },
                {
                  type: 'link',
                  text: 'open-data@virufy.org',
                  href: 'mailto:open-data@virufy.org',
                },
                {
                  type: 'text',
                  text: '. لأي استفسارات أخرى، يمكنكم الوصول إلينا عبر ',
                },
                {
                  type: 'link',
                  text: 'info@virufy.org',
                  href: 'mailto:info@virufy.org',
                },
                {
                  type: 'text',
                  text: '.',
                },
              ],
            },
          ],
        },
      ],
    },
  },
};

export default faq;
