import { type HomeType } from '../types/home';

const home: HomeType = {
  introSection: {
    text: 'مرحبًا بك في Virufy',
    text2: 'رفيقك الصحي الرقمي',
    subText: [
      [
        {
          type: 'text',
          text: 'نقدم لك ',
        },
        {
          type: 'span',
          text: 'Virufy',
        },
        {
          type: 'text',
          text: '، التطبيق المتطور الذي يستخدم الصوت والذكاء الاصطناعي التوليدي لتحليل أصوات تنفسك وتحديد الأنماط المرتبطة بأعراض العدوى.',
        },
      ],
      [
        {
          type: 'text',
          text: ' يهدف نهجنا المبتكر إلى تقديم فحص أولي للأمراض التنفسية للمرضى والأطباء والحكومات، خاصة في الدول منخفضة الدخل.',
        },
      ],
      [
        {
          type: 'text',
          text: ' نطمح لأن نكون المنظمة غير الربحية الرائدة في مجال تحديد الأمراض باستخدام التكنولوجيا، مما يغير الرعاية الصحية العالمية ويلهم الآخرين لدعم هذه المهمة والاستثمار فيها معنا.',
        },
      ],
    ],
    buttonText: 'جرب العرض التوضيحي',
    disclaimers: [
      '*أي جهاز يحتوي على متصفح ويب وميكروفون (مثل iPhone أو Android أو الكمبيوتر المحمول أو iPad).',
      '*التطبيق لا يزال قيد التطوير، ساعدنا من خلال المساهمة بأصوات السعال الخاصة بك في تطبيق جمع البيانات.',
    ],
    mainText2: 'كيف يعمل',
    subText2: [
      {
        type: 'text',
        text: 'بمجرد سعال بسيط موجه إلى ميكروفون جهازك، ',
      },
      {
        type: 'span',
        text: 'Virufy',
      },
      {
        type: 'text',
        text: ' تستفيد من قوة الذكاء الاصطناعي لتحليل أنماط الصوت المرتبطة بأمراض الجهاز التنفسي مثل كوفيد-19، الالتهاب الرئوي، الإنفلونزا، الفيروس المخلوي التنفسي (RSV)، مرض الانسداد الرئوي المزمن، والربو.',
      },
    ],
  },
  section2: {
    text: 'صحتك أولويتنا',
    subtext:
      'في Virufy، رفاهيتك هي جوهر كل ما نقوم به. نحن نولي الخصوصية أهمية قصوى، مما يضمن بقاء بياناتك آمنة وسرية.',
    title: ['تحليل فوري', 'الخصوصية في المنزل', 'واجهة سهلة الاستخدام'],
    sub: [
      'تغذية راجعة سريعة حول خصائص سعالِك وملف الشذوذ بناءً على نمط الصوت',
      'اشعر بالأمان مع العلم أن نتائجك خاصة بك وحدك.',
      'تصميم بديهي لتجربة استخدام سلسة وسهلة التنقل.',
    ],
    disclaimer:
      '*Virufy ليس بديلاً عن الاستشارة الطبية أو التشخيص أو العلاج المهني. يُنصح المستخدمون باستشارة مقدم رعاية صحية مرخص لأي مخاوف أو قرارات طبية.',
    buttonText: 'تقنيتنا',
  },
};

export default home;
