import type { sevenhomepage } from '../types/sevenhomepage';
const sevenHomePage: sevenhomepage = {
  introSection: {
    title: 'فحص صحة الجهاز التنفسي بقوة الذكاء الاصطناعي',
    subtitle: 'رفيقك الصحي الرقمي',
    text: 'بمجرد السعال البسيط في هاتفك، يقوم ذكاء Virufy بفحص أنماط صوتية مرتبطة بأمراض الجهاز التنفسي مثل COVID-19 و RSV والالتهاب الرئوي والربو والإنسداد الرئوي المزمن',
    missionbutton: 'مهمتنا',
    supportbutton: 'ادعمنا',
  },
  section2: {
    title: 'مهمتنا لإعادة تعريف الكشف المبكر',
    subtitle: 'توحيد العلم والتعاطف والابتكار لتقدم الكشف المبكر للجميع.',
    text: [
      'نحن منظمة غير ربحية مكرسة لتحويل كيفية كشف العالم وفهمه لأمراض الجهاز التنفسي، من خلال تحليل الصوت المتقدم والذكاء الاصطناعي التوليدي.',
      'مهمتنا هي جعل الكشف المبكر في متناول الجميع وخاصة وميسور التكلفة. من خلال توفير أدوات فحص تعتمد على الذكاء الاصطناعي تعمل على أي هاتف ذكي أو متصفح ويب، نمكن المرضى والأطباء والأنظمة الصحية، خاصة في المناطق منخفضة الدخل والمحرومة، من اتخاذ إجراء أسرع وتحسين النتائج الصحية في جميع أنحاء العالم.',
      'يسد Virufy الفجوة بين التكنولوجيا والإنسانية، محولاً اللحظات اليومية إلى فرص لرؤى منقذة للحياة والبحث السريري والشراكات العالمية والنزاهة العلمية.',
    ],
  },
  section3: {
    title: 'صحتك، أولويتنا',
    subtitle:
      'في Virufy، راحتك هي قلب كل ما نقوم به. نعطي الأولوية للخصوصية، مما يضمن بقاء بيانات أمنة وسرية.',
    cardtitle: ['تحليل فوري', 'الخصوصية في المنزل', 'واجهة سهلة الاستخدام'],
    cardtext: [
      'ردود فعل سريعة حول خصائص السعال ملفك الشخصي بناءً على نمط صوت السعال.',
      'اشعر بالأمان مع العلم أن النتائج مخصصة لعينيك فقط.',
      'واجهة سهلة الاستخدام مع تصميم بديهي للملاحة السهلة وتجربة المستخدم السلسة',
    ],
    disclaimer:
      '*Virufy ليس بديلاً عن المشورة الطبية المهنية أو التشخيص أو العلاج. يُنصح المستخدمون باستشارة مقدم رعاية صحية مرخص بشأن أي مخاوف طبية أو قرارات.*',
  },
  section4: {
    title: 'تقدم الصحة العالمية معاً.',
    subtitle:
      'يوحد Virufy الخبراء والمتطوعين في جميع أنحاء العالم لجعل فحص الجهاز التنفسي في متناول الجميع.',
    icons: [
      '../../images/sevenhome/globe.png',
      '../../images/sevenhome/hand.png',
      '../../images/sevenhome/gear.png',
    ],
    cardtitle: ['التعاون عبر الحدود', 'تمكين المجتمع', 'الابتكار المفتوح'],
    cardtext: [
      'العمل جنباً إلى جنب مع الجامعات والمستشفيات والمنظمات غير الربحية لتقدم البحث مفتوح المصدر.',
      'كل عينة سعال تساعد على تحسين دقة الذكاء الاصطناعي وتدعم نتائج صحية عادلة.',
      'تحركها مهمتنا الشفافية والتعاون العالمي مع عقلية تركز على الناس.',
    ],
  },
  section5: {
    title: 'اكتشف العلم وراء Virufy.',
    text: 'تعرف على كيفية اجتماع الذكاء الاصطناعي وتحليل الصوت للكشف عن أنماط الجهاز التنفسي وتقدم أبحاث الصحة العالمية.',
    button: 'استكشف تكنولوجيتنا',
  },
};
export default sevenHomePage;
