import {} from '@/public/images/story';
import { type Story } from '../types/story';

const story: Story = {
  storySection: {
    title: 'كيف بدأت الفكرة ',
    texts: [
      [
        {
          type: 'text',
          text: 'عندما ضربت الجائحة،',
        },
        {
          type: 'link',
          url: '/amils-story',
          text: 'مؤسس فيروفي، أميل خانزادا',
        },
        {
          type: 'text',
          text: 'كان يعلم أن الهواتف الذكية موجودة في كل مكان وأن COVID-19 يؤثر على الأنف والحلق والرئتين.',
        },
      ],
      [
        {
          type: 'text',
          text: 'افترض أن أصوات التنفس والسعال يمكن تحليلها باستخدام التعلم الآلي لاكتشاف أنماط كوفيد.',
        },
      ],
      [
        {
          type: 'text',
          text: 'ورغبة منه في إحداث تأثير إيجابي، قام أميل بتنظيم دراسة سريرية شملت 362 مريضًا في مستشفى جامعي مرموق. بدأ فريق Virufy الأصلي مع طلاب خريجي الذكاء الاصطناعي في جامعة ستانفورد وتوسع ليشمل متطوعين من الجامعات على مستوى العالم.',
        },
      ],
    ],
  },
  MissionSection: {
    title: 'مهمتنا',
    texts: [
      [
        {
          type: 'text',
          text: 'قد يتساءل البعض: "لماذا نحن هنا؟" و"لماذا حظيت Virufy بدعم هذا العدد الكبير من الناس؟"',
        },
      ],
      [
        {
          type: 'text',
          text: 'مهمة Virufy وهدفها هو إحداث تحول في الصحة العالمية.',
        },
      ],
      [
        {
          type: 'text',
          text: 'نهدف إلى تمكين الجميع حول العالم من الوصول إلى تطبيق ويب قادر على كشف أمراض الجهاز التنفسي مثل كوفيد، الإنفلونزا، فيروس RSV، مرض الانسداد الرئوي المزمن (COPD)، الربو، وسرطان الرئة — في غضون ثوانٍ.',
        },
      ],
      [
        {
          type: 'text',
          text: 'نرغب في تمكين مليار شخص في الدول النامية من حماية صحتهم وصحة أحبائهم.',
        },
      ],
      [
        {
          type: 'text',
          text: 'فيما يلي قائمة',
        },
        {
          type: 'link',
          url: '/advisors',
          text: 'المستشارين',
        },
        {
          type: 'text',
          text: 'المُعلنين، وقد بلغ عدد المتطوعين لدينا حتى الآن أكثر من 1300 متطوع.',
        },
      ],
      [
        {
          type: 'text',
          text: 'شكرًا لكونك جزءًا من هذه المهمة. دعونا نحققها معًا.',
        },
      ],
    ],
  },
  privacySection: {
    title: 'التزامنا بالخصوصية',
    texts: [
      'يأخذ Virufy خصوصية وحماية معلوماتك الشخصية على محمل الجد. قام فريقنا القانوني بإعداد سياسة خصوصية مفصلة وسياسة ملفات تعريف الارتباط لحماية المعلومات الشخصية التي تشاركها معنا من خلال استخدام موقعنا.',
    ],
  },
};

export default story;
