import { type Story } from '../types/story';

const story: Story = {
  storySection: {
    title: 'كيف بدأ الأمر',
    texts: [
      [
        {
          type: 'text',
          text: 'عندما ضربت الجائحة، ',
        },
        {
          type: 'link',
          url: '/amils-story',
          text: 'مؤسس Virufy أمل خانزادا',
        },
        {
          type: 'text',
          text: ' كان يعلم أن الهواتف الذكية منتشرة في كل مكان وأن كوفيد يؤثر على الجهاز التنفسي.',
        },
      ],
      [
        {
          type: 'text',
          text: 'افترض أن أصوات التنفس والسعال يمكن تحليلها باستخدام التعلم الآلي لاكتشاف أنماط كوفيد.',
        },
      ],
      [
        {
          type: 'text',
          text: 'سعياً لإحداث تأثير إيجابي، نظم أمل دراسة سريرية مع 362 مريضًا في مستشفى جامعي مرموق. بدأ فريق Virufy الأصلي مع طلاب دراسات عليا في الذكاء الاصطناعي من جامعة ستانفورد، ثم توسع ليشمل متطوعين من جامعات حول العالم.',
        },
      ],
    ],
  },
  MissionSection: {
    title: 'مهمتنا',
    texts: [
      [
        {
          type: 'text',
          text: 'قد يتساءل البعض: "لماذا نحن هنا؟" و"لماذا دعم الكثير من الناس Virufy؟"',
        },
      ],
      [
        {
          type: 'text',
          text: 'مهمة وهدف Virufy هو تحويل الصحة العالمية.',
        },
      ],
      [
        {
          type: 'text',
          text: 'نهدف إلى توفير أداة عبر الويب تتيح للناس حول العالم إمكانية فحص حالات تنفسية محتملة مثل كوفيد-19 والإنفلونزا والفيروس المخلوي التنفسي (RSV) ومرض الانسداد الرئوي المزمن والربو وغيرها من أمراض الرئة خلال ثوانٍ.',
        },
      ],
      [
        {
          type: 'text',
          text: 'هدفنا تمكين الأفراد، خصوصًا في المناطق النامية، من خلال أدوات تساعدهم على زيادة الوعي بصحتهم واتخاذ قرارات مستنيرة لأنفسهم ولأحبائهم.',
        },
      ],
      [
        {
          type: 'text',
          text: 'يرجى ملاحظة أن هذه الأداة ليست مخصصة لتقديم تشخيصات طبية ولا ينبغي أن تحل محل استشارة مختص رعاية صحية مؤهل.',
        },
        {
          type: 'text',
          text: 'نحن ممتنون لدعم مستشارينا ومساهمات أكثر من 1300 متطوع حتى الآن.',
        },
      ],
      [
        {
          type: 'text',
          text: 'شكرًا لكونك جزءًا من هذه المهمة.',
        },
      ],
    ],
  },
  privacySection: {
    title: 'الالتزام بالخصوصية',
    texts: [
      'تأخذ Virufy خصوصيتك على محمل الجد. قام فريقنا القانوني بتطوير سياسات مفصلة للخصوصية وملفات تعريف الارتباط لحماية أي معلومات شخصية تشاركها أثناء استخدام موقعنا الإلكتروني.',
    ],
  },
};

export default story;
