import { type AmilsStory } from '../types/amilsStory';

const amilsStory: AmilsStory = {
  sectionAmil: {
    titleAmil: 'アミルのストーリー',
    textAmil: [
      '移民家庭でシリコンバレーに生まれ育ったアミルは、ホームスクーリングを受け、14歳でコミュニティカレッジでの学びを始めました。アミルの父は社会奉仕に尽力しており、彼はホームレスに食事を提供するスープキッチンでのボランティア活動などに参加しながら育ちました。ほどなくして、アミルの父は飲酒運転の車との交通事故で亡くなりました。英雄を失った悲しみを乗り越えながら、アミルはK-12の学校でテストの自動採点技術を開発するソフトウェアコンサルタントとして初めての仕事を手にしました。',
      'カリフォルニア大学バークレー校でコンピュータサイエンスの学士号を取得後、アミルはシリコンバレーのヒューレット・パッカード（HP）にフルタイムのソフトウェアエンジニアとして入社し、ArcSight（セキュリティ情報とイベント管理システム：SIEM）のためのセキュリティログ標準化ソフトウェアを開発しました。',
      '新たな拠点を求めて、アミルはHPの東京本社に転勤し、サイバーセキュリティコンサルタントとして銀行業界の顧客サイトにSIEMソリューションを展開するため、香港、東京、オーストラリアを飛び回りました。',
      'その後、アミルはシリコンバレーに戻り、主にPostgresベースのオープンソースOLAPデータベースであるGreenplumに携わるソフトウェアエンジニアとしてPivotal Softwareに参加しました。Pivotalのエクストリームプログラミング（XP）環境では、アミルは日々のペアプログラミング、テスト駆動開発（TDD）、毎週の振り返りミーティングなど、さまざまなソフトウェア開発の実践を行い、DevOps、データベースバックエンド、ワークロード管理ツールを含む複数のチームをローテーションしました。',
      '2018年、アミルは日本の田舎に移住するために仕事を休みました。曹洞宗の発祥地である永平寺町に住み、毎日瞑想を行い禅哲学を学びながら、若者や子供たちにアジャイルプログラミングを教えて社会貢献しました。やがてアミルは町のエボリューションアンバサダーに任命され、オランダで開催されたOne Young Worldカンファレンスに、日本を代表して他の若い社会的影響力を持つリーダーや195カ国の国の代表、ノーベル賞受賞者たちとともに参加しました。',
      '2019年末、アミルはスタンフォード大学で人工知能の大学院研究を追求するために仕事を辞め、Courseraの創設者アンドリュー・ン博士やImageNetの創設者であるフェイフェイ・リー博士の下で最初の授業を受けました。パンデミックが発生すると、アミルはパンデミック救済活動に専念し、間もなくVirufyを設立しました。',
      'Virufyは、声や咳の録音をAIで分析し、COVID-19を即座にスクリーニングするスマートフォンアプリを開発している非営利団体です。2024年7月現在、この団体は3つの大陸で運営されており、250人以上のボランティアと60のパートナー組織が関与しています。',
    ],
    titlePublications: 'アミルの出版物',
    listPublications: [
      '2022年. COVID-19の分類における大規模集約データセットを使用したディープラーニングの利用. arXiv: 2201.01669',
      '2021年. 新しいCOVID-19計算機を使用した、COVID-19事前スクリーニングソリューション（AI/ML）の米国の社会経済的影響の測定. arXiv: 2201.11109',
      '2020年. Virufy: 咳の録音からCOVID-19を検出するAIのグローバルな適用性. arXiv: 2011.13320',
      '2020年. Fusical: マルチモーダル融合によるビデオ感情分析. ACM ICMI; DOI: 3382507.3417966',
      '2020年. ディープラーニングによる表情認識. arXiv: 2004.11823',
    ],
  },
};

export default amilsStory;
